/*
 * 功能 : 封装公共常量
 * 作者 : 罗永梅（381612175@qq.com）
 * 日期 : 2017-8-31
 * 版本 : version 1.0
 */

export default {
    /* 配置信息 */
    // bmob 应用密钥
    APPLICATION_ID: '07ffab130cdf11f91381f18779fcf697',
    REST_API_KEY: '653887187daf660941971acf257cccc1',

    /* 通用正则表达式 */
    // 企业单位名称
    regCompanyName: /^[\u4E00-\u9FA5a-zA-Z]((?![·\.\(\)（）]{2,4})([\u4E00-\u9FA5a-zA-Z·\.\(\)（）])){0,98}[\u4E00-\u9FA5]$/,
    // 真实姓名
    regRealName: /^[\u4E00-\u9FA5](([\u4E00-\u9FA5]|·(?!·))){0,18}[\u4E00-\u9FA5]$/,
    // 统一社会信用代码
    regUscCode: /^[0-9A-ZW]{18}$/,
    // 银行账户
    regBankAccount: /^[1-9]\d{7,25}$/,
    // 邮政编码正则表达式
    regPostCode: /^[1-9]\d{5}$/,
    // 邮箱正则表达式
    regEmail: /^[\.a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
    // 企业单位名称
    regCompanyName: /^[\u4E00-\u9FA5a-zA-Z]((?![·\.\(\)（）]{2,4})([\u4E00-\u9FA5a-zA-Z·\.\(\)（）])){0,98}[\u4E00-\u9FA5]$/,
    // 手机号正则表达式
    regMobile: /^1(3|4|5|7|8)\d{9}$/,
    // 密码正则表达式
    regPassword: /^[\w]{6,12}$/,
    // 网站地址正则表达式
    regWebsite: /^[\u4E00-\u9FA5A\w\-_]+(\.[\u4E00-\u9FA5A\w\-_]+)+([\u4E00-\u9FA5A\w\-\.,@?^=%&amp;:/~\+#]*[\u4E00-\u9FA5A\w\-\@?^=%&amp;/~\+#])?/,
    // 普通电话(包含手机和座机)正则表达式
    regPhone: /^(1\d{10}$)|(((400)-(\d{3})-(\d{4}))|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{3,7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)$/,
    // 快递单号
    regExpressNum: /^[1-9]\d{9,17}$/,
    // 订单编号
    regOrderID: /^[0-9A-ZW]{20}$/,
    // 发票编号
    regInvoiceID: /^[1-9]\d{1,10}$/
}
